src/Documents/ВозвратПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.Поступление</xr:Item>
				<xr:Item>Document.ПоступлениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВозврата</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ДополнительнаяКолонкаПечатныхФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДополнительнаяКолонкаПечатныхФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыводить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ВозвратПоставщику/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс	
	
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаВозвратЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратЗапасовПоставщикуЗапасы.НомерСтроки КАК НомерСтроки,
	|	ВозвратЗапасовПоставщикуЗапасы.Ссылка КАК Документ,
	|	ВозвратЗапасовПоставщикуЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	ВозвратЗапасовПоставщикуЗапасы.Ссылка.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВозвратЗапасовПоставщикуЗапасы.Ссылка.Дата КАК Период,
	|	ВозвратЗапасовПоставщикуЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВозвратЗапасовПоставщикуЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ВозвратЗапасовПоставщикуЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВозвратЗапасовПоставщикуЗапасы.Количество КАК Количество,
	|	ВозвратЗапасовПоставщикуЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВозвратЗапасовПоставщикуЗапасы.Всего КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ВозвратПоставщику.Запасы КАК ВозвратЗапасовПоставщикуЗапасы
	|ГДЕ
	|	ВозвратЗапасовПоставщикуЗапасы.Ссылка = &Ссылка
	|	И НЕ ВозвратЗапасовПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.НомерСтроки КАК НомерСтроки,
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка КАК Документ,
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка.Организация
	|	КОНЕЦ КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка.Дата КАК Период,
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Сумма * -1 КАК Сумма,
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка.ОснованиеВозврата КАК ДокументРеализации,
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	Документ.ВозвратПоставщику.Запасы КАК ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов
	|ГДЕ
	|	ВозвратЗапасовПоставщикуВзаморасчетыКонрагентов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВозвратПоставщикуЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ВозвратПоставщикуЗапасы.Ссылка.Дата КАК Период,
	|	ВозвратПоставщикуЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ВозвратПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Имущество)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы)
	|	КОНЕЦ КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики) КАК СчетКт,
	|	ВозвратПоставщикуЗапасы.Номенклатура КАК СубконтоДт1,
	|	ВозвратПоставщикуЗапасы.Ссылка.Склад КАК СубконтоДт2,
	|	ВозвратПоставщикуЗапасы.Ссылка.Контрагент КАК СубконтоКт1,
	|	-СУММА(ВозвратПоставщикуЗапасы.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВозвратПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|				ИЛИ ВозвратПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал)
	|			ТОГДА -СУММА(ВозвратПоставщикуЗапасы.Количество)
	|	КОНЕЦ КАК Количество,
	|	""Возврат поставщику(запасы)"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.ВозвратПоставщику.Запасы КАК ВозвратПоставщикуЗапасы
	|ГДЕ
	|	ВозвратПоставщикуЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратПоставщикуЗапасы.Ссылка.Дата,
	|	ВозвратПоставщикуЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ВозвратПоставщикуЗапасы.Номенклатура,
	|	ВозвратПоставщикуЗапасы.Ссылка.Склад,
	|	ВозвратПоставщикуЗапасы.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА ВозвратПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Имущество)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы)
	|	КОНЕЦ,
	|	ВозвратПоставщикуЗапасы.Номенклатура.ТипНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылкаВозвратЗапасов);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаВозвратЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаВозвратЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаВозвратЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаВозвратЗапасов, СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор КАК Договор,
	|	СУММА(ТаблицаВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

#Область ПроцедурыИФункуииФормированияПечатныхформ

// Функция формирует печатную форму ВозвратПоставщику документа.
//
Функция СформироватьПечатнуюФормуВозвратПоставщику(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВозвратПоставщику.Ссылка КАК Ссылка,
	|	ВозвратПоставщику.Номер КАК Номер,
	|	ВозвратПоставщику.Дата КАК Дата,
	|	ВозвратПоставщику.Контрагент КАК Получатель,
	|	ВозвратПоставщику.СтруктурнаяЕдиница.Организация КАК Организация,
	|	ВозвратПоставщику.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	|	ВозвратПоставщику.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК Валюта,
	|	ВозвратПоставщику.ВидЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ИЗ
	|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
	|ГДЕ
	|	ВозвратПоставщику.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.НоменклатураНаименованиеПолное КАК ТоварНаименованиеПолное,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.НоменклатураКод КАК Код,
	|	ВложенныйЗапрос.НоменклатураЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.СуммаНДС,
	|	ВложенныйЗапрос.НоменклатураЕдиницаИзмеренияНаименование КАК ЕдиницаЦены,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.Упаковка,
	|	ВложенныйЗапрос.Партия,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВозвратПоставщикуЗапасы.Ссылка КАК Ссылка,
	|		ВозвратПоставщику.Ссылка КАК Ссылка1,
	|		ВозвратПоставщикуЗапасы.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|		ВозвратПоставщикуЗапасы.Номенклатура КАК Номенклатура,
	|		ВозвратПоставщикуЗапасы.Номенклатура.Код КАК НоменклатураКод,
	|		ВозвратПоставщикуЗапасы.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|		ВозвратПоставщикуЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК НоменклатураЕдиницаИзмеренияНаименование,
	|		ВозвратПоставщикуЗапасы.Цена КАК Цена,
	|		ВозвратПоставщикуЗапасы.Сумма КАК Сумма,
	|		ВозвратПоставщикуЗапасы.СуммаНДС КАК СуммаНДС,
	|		ВозвратПоставщикуЗапасы.КоличествоУпаковок КАК Количество,
	|		ВозвратПоставщикуЗапасы.Упаковка КАК Упаковка,
	|		ВозвратПоставщикуЗапасы.Партия КАК Партия
	|	ИЗ
	|		Документ.ВозвратПоставщику.Запасы КАК ВозвратПоставщикуЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратПоставщику КАК ВозвратПоставщику
	|			ПО ВозвратПоставщикуЗапасы.Ссылка = ВозвратПоставщику.Ссылка
	|	ГДЕ
	|		ВозвратПоставщику.Ссылка В(&МассивДокументов)) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Ссылка
	|ИТОГИ ПО
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВозвратТоваровПоставщику_Накладная";
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МассивРезультатов   = Запрос.ВыполнитьПакет();
	ДанныеПечати        = МассивРезультатов[0].Выбрать();
	ВыборкаПоДокументам = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	ДопКолонка = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДополнительнаяКолонкаПечатныхФормДокументов");
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		НайденСледующий = ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		// Макет необходимо получать для каждого документа, т.к. размеры колонок изменяются динамически
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВозвратПоставщику.ПФ_MXL_ВозвратПоставщику");
		
		ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		
		ОбластьКолонкаТовар = Макет.Область("Товар");
		
		//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ТекстЗаголовка = НСтр("ru='Возврат поставщику № %НомерДокумента% от %ДатаДокумента% г.'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%НомерДокумента%", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ДанныеПечати.Номер, ДанныеПечати.Префикс));
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ДатаДокумента%",  Формат(ДанныеПечати.Дата, "ДФ='дд ММММ гггг'"));
		
		ОбластьНомера = Макет.ПолучитьОбласть("Заголовок|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("Заголовок|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("Заголовок|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("Заголовок|КоличествоЦена");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Заголовок|Сумма");
		
		ОбластьНомера.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Поставщик");
		ПредставлениеПоставщика                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		ОбластьМакета.Параметры.Поставщик               = ДанныеПечати.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		ПредставлениеПолучателя                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Получатель, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель              = ДанныеПечати.Получатель;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы Товары
		
		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|КоличествоЦена");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицы1|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицы1|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицы1|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицы1|КоличествоЦена");
		ОбластьСуммы  = Макет.ПолучитьОбласть("СтрокаТаблицы1|Сумма");
		
		Сумма          = 0;
		СуммаНДС       = 0;
		НомерСтроки    = 0;
		
		// Выводим строки таблицы Товары
		
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаПоТоварам.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаПоТоварам.Код;
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			
			ОбластьТовар.Параметры.Заполнить(ВыборкаПоТоварам);
			ОбластьТовар.Параметры.Товар = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаПоТоварам.ТоварНаименованиеПолное, Неопределено)
			+ ?(ВыборкаПоТоварам.ЭтоВозвратнаяТара, НСтр("ru=' (возвратная тара)'"), "");
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			ОбластьДанных.Параметры.Заполнить(ВыборкаПоТоварам);
			
			Если НЕ ВыборкаПоТоварам.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка() Тогда
				
				ОбластьДанных.Параметры.ЕдиницаЦены = ВыборкаПоТоварам.Упаковка.Наименование + "(" + ВыборкаПоТоварам.Упаковка.Коэффициент + ")";
				
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			ОбластьСуммы.Параметры.Заполнить(ВыборкаПоТоварам);
			
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			Сумма          = Сумма          + ВыборкаПоТоварам.Сумма;
			СуммаНДС       = СуммаНДС       + ВыборкаПоТоварам.СуммаНДС;
			
		КонецЦикла;
		
		// Выводим подвал
		
		ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицы|КоличествоЦена");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ПодвалТаблицы|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		ОбластьСуммы.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		// Выводим ИтогоНДС
		
		ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КоличествоЦена");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		ОбластьДанных.Параметры.НДС = ?(ДанныеПечати.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'"));
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		ОбластьСуммы.Параметры.ВсегоНДС = ФормированиеПечатныхФорм.ФорматСумм(СуммаНДС);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		
		// Выводим Сумму прописью
		
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = НСтр("ru='Всего наименований %КоличествоНаименований%, на сумму %СуммаДокумента% '");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоНаименований%", ВыборкаПоТоварам.Количество());
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%СуммаДокумента%", ФормированиеПечатныхФорм.СуммаРубКоп(СуммаКПрописи, ,));//ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
		ОбластьМакета.Параметры.СуммаПрописью  = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подписи
		ОбластьНомера = Макет.ПолучитьОбласть("ПодписиЛиния|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ПодписиЛиния|КолонкаКодов");
		ОбластьТовар  = Макет.ПолучитьОбласть("ПодписиЛиния|Товар");
		ОбластьДанных = Макет.ПолучитьОбласть("ПодписиЛиния|КоличествоЦена");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ПодписиЛиния|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуВозвратПоставщику()

#КонецОбласти

#область ПроцедурыИФункцииПечати

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВозвратПоставщику") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВозвратПоставщику", "Возврат поставщику", СформироватьПечатнуюФормуВозвратПоставщику(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	
КонецПроцедуры // Печать()

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("ВозвратПоставщику", "Возврат поставщику", , БиблиотекаКартинок.Документ);
	
	Возврат Список;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	ЭтоЗапасы = (ПолноеИмяОбъектаЗаполнения = "Документ.ВозвратПоставщику.ТабличнаяЧасть.Запасы");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", "Группа", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, , , , );
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Код", "Код", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", "Штрихкод", ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", "Артикул", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование","Номенклатура (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 4, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное","Номенклатура (полное наименование)", ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодСинхронизации", "Код синхронизации", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 6,,Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", "Партия (наименование)", ОписаниеТиповСтрока150, ОписаниеТиповКолонка);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", "Количество", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", "Цена", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , ,);	
		
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПоУмолчанию", "Упаковка поступления", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПродажи", "Упаковка продажи", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Коэффициент", "Коэффициент упаковки", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);

КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	//Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	//ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	//
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	//
	//Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	//ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	//НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	НастройкиОбновленияСвойств  = ПараметрыСопоставления.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ПолноеИмяОбъектаЗаполнения 	= НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;

	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное, Код, КодСинхронизации
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, 
			СтрокаТаблицыФормы.Штрихкод, 
			СтрокаТаблицыФормы.Артикул, 
			СтрокаТаблицыФормы.НоменклатураНаименование, 
			СтрокаТаблицыФормы.НоменклатураНаименованиеПолное, 
			СтрокаТаблицыФормы.Код,
			СтрокаТаблицыФормы.КодСинхронизации);
		ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
		
		// Родитель по наименованию
		ЗначениеПоУмолчанию = Справочники.Номенклатура.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Номенклатура", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель)
			И ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель_ВходящиеДанные) Тогда
			
			ГруппаНоменклатуры = Справочники.Номенклатура.СоздатьГруппу();
			ГруппаНоменклатуры.Наименование = СтрокаТаблицыФормы.Родитель_ВходящиеДанные;
			ГруппаНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
			ГруппаНоменклатуры.Записать();
			СтрокаТаблицыФормы.Родитель = ГруппаНоменклатуры.Ссылка;
			
		КонецЕсли;
		
		// Упаковк по умолчанию
		ЗначениеПоУмолчанию = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьУпаковку(СтрокаТаблицыФормы.УпаковкаПоУмолчанию, СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Коэффициент
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Коэффициент, СтрокаТаблицыФормы.Коэффициент_ВходящиеДанные, 1);
		
		Если НЕ ЭтаСтрокаСопоставлена
			И ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименование) Тогда
						
			ЭлементСправочника = Справочники.Номенклатура.СоздатьЭлемент();	
			ЭлементСправочника.Заполнить(Новый Структура("Родитель", СтрокаТаблицыФормы.Родитель));
			ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицыФормы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(ПараметрыСопоставления.НастройкиЗагрузкиДанных));
			ЭлементСправочника.Записать();
			СтрокаТаблицыФормы.Номенклатура = ЭлементСправочника.Ссылка;
			
			ЭлементСправочника.Наименование = СтрокаТаблицыФормы.НоменклатураНаименование;
			ЭлементСправочника.НаименованиеПолное = ?(ПустаяСтрока(СтрокаТаблицыФормы.НоменклатураНаименованиеПолное), СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
			ЭлементСправочника.ЭтоУслуга = ?(ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, Истина, Ложь);
			ЭлементСправочника.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
						
			Если Не ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные) Тогда
				
				// Создать упаковку по умолчанию
				НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
				НоваяУпаковка.Владелец     = ЭлементСправочника.Ссылка;
				НоваяУпаковка.Наименование = СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные;
				НоваяУпаковка.Коэффициент  = СтрокаТаблицыФормы.Коэффициент;
				НоваяУпаковка.Записать();
			 
				ЭлементСправочника.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
				СтрокаТаблицыФормы.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
								
			КонецЕсли;
			
			ЭлементСправочника.Записать();

		КонецЕсли;
				
		//Если ПолноеИмяОбъектаЗаполнения = "Документ.ВозвратПоставщику.ТабличнаяЧасть.Запасы" Тогда
		//	
		Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда			
			СтрокаТаблицыФормы.Номенклатура = Неопределено;			
		КонецЕсли;
			
			//// Партия по Владельцу и Наименованию
			//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
						
			//ХарактеристикаСсылка = Справочники.ПартииНоменклатуры.ПустаяСсылка();
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				СсылкаНомеклатуры = СтрокаТаблицыФормы.Номенклатура.Ссылка;
				Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Партия_ВходящиеДанные) Тогда
					
					НомеклатураОбъект = СсылкаНомеклатуры.ПолучитьОбъект();
					Если НомеклатураОбъект.ИспользоватьПартии = Ложь Тогда
						НомеклатураОбъект.ИспользоватьПартии = Истина;
						НомеклатураОбъект.Записать();
					КонецЕсли;
					
					НоваяХарактеристика = Справочники.ПартииНоменклатуры.Выбрать(, СсылкаНомеклатуры, Новый Структура("Наименование", СтрокаТаблицыФормы.Партия_ВходящиеДанные));
					Если НоваяХарактеристика.Следующий() Тогда
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					Иначе
						НоваяХарактеристика              = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
						НоваяХарактеристика.Владелец     = СсылкаНомеклатуры;
						НоваяХарактеристика.Наименование = СтрокаТаблицыФормы.Партия_ВходящиеДанные;
						НоваяХарактеристика.Записать();
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
	
		//КонецЕсли;
								
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// Цена
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 0);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	Если ПолноеИмяОбъектаЗаполнения = "Документ.ВозвратПоставщику.ТабличнаяЧасть.Запасы" Тогда
		
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
			И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
			И СтрокаТаблицыФормы.Количество <> 0;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
